<a href="https://colab.research.google.com/github/pradeepetech/testproject/blob/master/PHDEDA.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
a = []
while(1):
    a.append('1')

In [0]:
# Importing required libraries.
import pandas as pd
import numpy as np
import seaborn as sns #visualisation
import matplotlib.pyplot as plt #visualisation
%matplotlib inline 
sns.set(color_codes=True)
import os

In [3]:
# Loading Data in pandas Dataframe
df1 = pd.read_csv("/content/drive/My Drive/traindata.csv")
# Dataset is now stored in a Pandas Dataframe

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [4]:
os.getcwd()

'/content'

In [6]:
# To display the top 5 rows
df1.head(5)

         date   locationId      item_id  unit_sales onpromotion
0  2015-01-01  location_25  item_103665         7.0         NaN
1  2015-01-01  location_25  item_105574         1.0         NaN
2  2015-01-01  location_25  item_105575         2.0         NaN
3  2015-01-01  location_25  item_108079         1.0         NaN
4  2015-01-01  location_25  item_108701         1.0         NaN

In [8]:
# Checking the data type
df1.dtypes

date            object
locationId      object
item_id         object
unit_sales     float64
onpromotion     object
dtype: object

In [10]:
# Dropping irrelevant columns
df1 = df1.drop(["locationId"], axis=1)
df1.head(5)

         date      item_id  unit_sales onpromotion
0  2015-01-01  item_103665         7.0         NaN
1  2015-01-01  item_105574         1.0         NaN
2  2015-01-01  item_105575         2.0         NaN
3  2015-01-01  item_108079         1.0         NaN
4  2015-01-01  item_108701         1.0         NaN

In [12]:
# Renaming the column names
df1 = df1.rename(columns={"date": "Date", "item_id":"Product ID", "unit_sales":"Unit_Sales", "onpromotion":"Onpromotion"})
df1.head(5)

         Date   Product ID  Unit_Sales Onpromotion
0  2015-01-01  item_103665         7.0         NaN
1  2015-01-01  item_105574         1.0         NaN
2  2015-01-01  item_105575         2.0         NaN
3  2015-01-01  item_108079         1.0         NaN
4  2015-01-01  item_108701         1.0         NaN

In [14]:
# Total number of rows and columns
df1.shape

(101688779, 4)

In [17]:
# Rows containing duplicate data
duplicate_rows_df1 = df1[df1.duplicated()]
print("number of duplicate rows:", duplicate_rows_df1.shape)

number of duplicate rows: (55563106, 4)

In [19]:
# Used to count the number of rows before removing the data
df1.count()

Date           101688779
Product ID     101688779
Unit_Sales     101688779
Onpromotion     80031128
dtype: int64

In [20]:
# Dropping the duplicates 
df1 = df1.drop_duplicates()
df1.head(5)

         Date   Product ID  Unit_Sales Onpromotion
0  2015-01-01  item_103665         7.0         NaN
1  2015-01-01  item_105574         1.0         NaN
2  2015-01-01  item_105575         2.0         NaN
3  2015-01-01  item_108079         1.0         NaN
4  2015-01-01  item_108701         1.0         NaN

In [21]:
# Counting the number of rows after removing duplicates.
df1.count()

Date           46125673
Product ID     46125673
Unit_Sales     46125673
Onpromotion    36172543
dtype: int64

In [22]:
# Finding the null values.
print(df1.isnull().sum())

Date                 0
Product ID           0
Unit_Sales           0
Onpromotion    9953130
dtype: int64

In [23]:
# Dropping the missing values.
df1 = df1.dropna() 
df1.count()

Date           36172543
Product ID     36172543
Unit_Sales     36172543
Onpromotion    36172543
dtype: int64

In [24]:
# After dropping the values
print(df1.isnull().sum())

Date           0
Product ID     0
Unit_Sales     0
Onpromotion    0
dtype: int64

In [0]:
##Detecting Outliers

In [0]:
sns.boxplot(x=df1["Date"])

In [0]:
sns.boxplot(x=df1["Product ID"])

In [0]:
sns.boxplot(x=df1["Unit_Sales"])

In [0]:
Q1 = df1.quantile(0.25)
Q3 = df1.quantile(0.75)
IQR = Q3 — Q1
print(IQR)

In [0]:
df1 = df1[~((df1 < (Q1–1.5 * IQR)) |(df1 > (Q3 + 1.5 * IQR))).any(axis=1)]
df.shape

In [0]:
# Plotting a Histogram
df1.Make.value_counts().nlargest(40).plot(kind=’bar’, figsize=(10,5))
plt.title(“forecast the sales”)
plt.ylabel("Unit_Sales")
plt.xlabel(‘Sale’);